## Task 0

In [1]:
# import liabraries
# sqlite3 helps Python open the sqlite file
# duckdb helps to create a duckdb database
# pandas use to load and move the data

import duckdb
import pandas  as pd
import matplotlib.pyplot as plt

In [ ]:
# # Open sqlite database to read tables

# # Connnect to sqlite database, bridge btwn Python & sakila.sqlite file
# sqlite_conn = sqlite3.connect(sqlite_path)   

# # Read table names: asks SQLite to show all table names inside this data
# tables_query="SELECT name FROM sqlite_master WHERE type ='table';"

# # pd.read_sql runs the sql query & makes it easy to view the table names.
# tables = pd.read_sql(tables_query, sqlite_conn)

# # Display the list of tables so we know what exists in sqlite database
# tables

Empty DataFrame
Columns: [name]
Index: []

### Connect to DuckDB

In [2]:
# Connect to duckdb database

con = duckdb.connect("sakila.duckdb")

## Task  1

#### a) Movies longer than 3-hours (180 min), show the title and its length

In [ ]:
# Select movies longer than 180 minutes
query = """ 
SELECT title, length
FROM film
WHERE length > 180
"""

# Run SQL and convert to pandas dataframe
long_movies = con.execute(query).df()

# Show result
long_movies

#### b) Movies with the word "love" in the title

In [ ]:
# Find movies that contain 'love' in the title
query = """ 
SELECT title, rating, length, description
FROM film
WHERE LOWER(title) LIKE '%love%'
"""

love_movies = con.execute(query).df()
love_movies

#### c) Movies length statistics
We calculate:
- shortest
- average
- median
- longest

In [ ]:
query = """ 
SELECT
    MIN(length) AS shortest,
    AVG(length) AS average,
    MEDIAN(length) AS median,
    MAX(length) AS longest
FROM film
"""

movie_stats = con.execute(query).df()
movie_stats

#### d) 10 most expensive movies to rent per day

In [ ]:
cost per day = rental_rate / rental_duration

query = """ 
SELECT title,
       rental_rate,
       rental_duration,
       rental_rate / rental_duration AS cost_per_day
FROM film
ORDER BY cost_per_day DESC
LIMIT 10
"""

expensive_movies = con.execute(query).df()
expensive_movies

#### e) Top 10 actors with the number of movies they have played in

In [ ]:
query = """ 
SELECT
    a.first_name || '' || a.last_name AS actor_name,
    COUNT(fa.film_id) AS movie_count
FROM actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
GROUP BY actor_name
ORDER BY movie_count DESC
LIMIT 10
"""

top_actors = con.execute(query).df()
top_actors

#### f) My own 3 simple questions

Q_1 : Which categories have most movies?

In [6]:
query = """ 
SELECT c.name AS category, COUNT(*) AS movies
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
GROUP BY category
ORDER BY movies DESC
"""

category_movies = con.execute(query).df()
category_movies

CatalogException: Catalog Error: Table with name category does not exist!
Did you mean "pg_attrdef"?

LINE 3: FROM category c
             ^

Q_2: Average rental rate per category

In [ ]:
query = """ 
SELECT c.name AS category, AVG(f.rental_rate) AS avg_rate
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
GROUP BY category
"""

avg_rates = con.execute(query).df()
avg_rates

Q_3: Top 5 customers by number of rentals

In [ ]:
query = """ 
SELECT c.first_name || '' || c.last_name AS customer,
       COUNT(r.rental_id) AS rentals
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
GROUP BY customer
ORDER BY rentals DESC
LIMIT 5
"""

top_renters = con.execute(query).df()
top_renters

## Task 2 - Graphs

#### a) Top 5 customers by total spend

In [7]:
query = """ 
SELECT c.first_name || '' || c.last_name AS customer,
       SUM(p.amount) AS total_spend
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY customer
ORDER BY total_spend DESC
LIMIT 5
"""

top_spend = con.execute(query).df()

# Bar chart
plt.figure()
plt.bar(top_spend['customer'], top_spend['total_spend'])
plt.title('Top 5 Customers by Total Spend')
plt.xlabel('Customer')
plt.ylabel('Total Spend')
plt.show()

CatalogException: Catalog Error: Table with name customer does not exist!
Did you mean "pg_constraint or sqlite_master"?

LINE 4: FROM customer c
             ^

#### b) Revenue per film category

In [8]:
query = """ 
SELECT c.name AS category,
       SUM(p.amount) AS revenue
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN inventory i ON fc.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN payment p ON r.rental_id = p.rental_id
GROUP BY revenue DESC
"""

revenue_category = con.execute(query).df()

plt.figure()
plt.bar(revenue_category['category'], revenue_category['revenue'])
plt.title('Revenue per Film Category')
plt.xlabel('Category')
plt.ylabel('Revenue')
plt.xticks(rotation=45)
plt.show()

ParserException: Parser Error: syntax error at or near "DESC"

LINE 9: GROUP BY revenue DESC
                         ^